WcfHarness/WcfHarness/RequestXmls/ManageScopePermissions.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <ManageScopePermissions xmlns="http://www.tavisca.com/Vexiere/IScope/2013/01">
      <manageScopePermissionsRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:OperationMode>AppendMode</a:OperationMode>
        <a:PermissionIdentifiers>
          <a:PermissionIdentifier i:type="a:IdBasedPermissionIdentifier">
            <a:Id>1</a:Id>
          </a:PermissionIdentifier>
        </a:PermissionIdentifiers>
        <a:ScopeIdentifier i:type="a:IdBasedScopeIdentifier">
          <a:Id>1</a:Id>
        </a:ScopeIdentifier>
      </manageScopePermissionsRequest>
    </ManageScopePermissions>
  </s:Body>
</s:Envelope>